Documents/НачислениеЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеЗадолженности</Name>
			<BasedOn>
				<xr:Item>Document.ВводДенежныхСредств</xr:Item>
				<xr:Item>Document.РасчетНДФЛ</xr:Item>
				<xr:Item>Document.НачислениеДивидендов</xr:Item>
				<xr:Item>Document.РазмещениеКредитногоИнструмента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияНалогов</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПоСделке</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеДоходыИРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вознаграждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьВСЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКлиентскомуОтноситьНаДатуОплаты</Name>
					<Comment>По клиентскому учету относить на дату оплаты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериодаНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогИлиВзнос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалогиИВзносы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачестьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСПоОбщимРасходам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предварительно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Арендатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактураСводный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/МетодыПризнанияРасходовПоСделкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>МетодыПризнанияРасходовПоСделкам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗакрытииРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЗависимостиОтПериодичности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриНачислении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЗависимостиОтПериодичностиСОтражениемНаСчетеРасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриОткрытииРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗакрытии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриОткрытии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйИнвестиционныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиАкционерныхИнвестиционныхФондов</Name>
					<Comment>Управление активами АИФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПаевогоИнвестиционногоФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФОГФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеИмуществомСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиНакоплениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиРезервами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеРезервамиСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеСобственнымиСредствамиПенсионныхФондов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЦелевыхКапиталов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСделок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПроизводныхФинансовыхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыПроизводныхФинансовыхИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фьючерс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опцион</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НачислениеЗадолженности/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Данные.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ) Тогда
		Представление = "Начисление НДФЛ " + Данные.Номер + " от " + Данные.Дата;
	Иначе
		Представление = "Начисление задолженности " + НРег(Данные.ВидЗадолженности.Наименование) + " " + Данные.Номер + " от " + Данные.Дата;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ВидЗадолженности");
	Поля.Добавить("Ссылка");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Функция ПодготовитьНаборПроводок(ДокументСсылка, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь) Экспорт
		
	Движения = РегистрыБухгалтерии[УчетныйРегистр].СоздатьНаборЗаписей();
	
	Если Не ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
		Возврат Движения;
	КонецЕсли;
	
	МетодОпределенияДоходовИРасходов = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата, 
		Организация, 
		СчетДоверительногоУправления,
		УчетныйРегистр,
		"МетодОпределенияДоходовИРасходов");
		
	Если Не ЗначениеЗаполнено(МетодОпределенияДоходовИРасходов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках по виду учета " + УчетныйРегистр + " не указан метод определения доходов и расходов. Документ не проведен по виду учета!", ДокументСсылка,,,Отказ);
		Возврат Движения;
	КонецЕсли;	
		
	Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоИнымДоходамПоИмуществу Тогда
		ПодготовитьНаборПроводокПоИнымДоходамПоИмуществу(ДокументСсылка, Движения, УчетныйРегистр, Отказ);
		Возврат Движения;
	КонецЕсли;
	
	СведенияОбОбращенииКорзиныЦенныхБумагНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииКорзиныЦенныхБумагНаОРЦБ(Дата, ДокументСсылка, УчетныйРегистр, "Основания");
	
	УказыватьДоговорВАналитике = ВидЗадолженности.Родитель = Справочники.ВидыЗадолженности.Недвижимость;
	
	Основания = ПолучитьТаблицуОснований(ДокументСсылка);
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Контрагент, Договор, ПрочиеДоходыИРасходы, Брокер, НДСВключатьВСтоимость, ЗачестьНДС, НДСПоОбщимРасходам, Предварительно, МестоХранения, Арендатор, ДоговорАренды");
	Контрагент 			 = ДанныеДокумента.Контрагент;
	Договор 			 = ДанныеДокумента.Договор;
	ПрочиеДоходыИРасходы = ДанныеДокумента.ПрочиеДоходыИРасходы;
	Брокер 				 = ДанныеДокумента.Брокер;
	Арендатор 			 = ДанныеДокумента.Арендатор;
	ДоговорАренды 		 = ДанныеДокумента.ДоговорАренды;
	
	КомиссияПоБиржевымДепозитам = (ВидЗадолженности = Справочники.ВидыЗадолженности.ПоТорговойКомиссии И ДанныеДокумента.МестоХранения = Справочники.МестаХранения.ММВБ_ДепозитыСЦК);
	
	Если ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ) Тогда
		СчетУчетаУслуг = ПланыСчетов.Основной.НДФЛ;
	ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаПрибыль Тогда
		СчетУчетаУслуг = ПланыСчетов.Основной.НалогНаПрибыль;
	ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаИмущество Тогда
		СчетУчетаУслуг = ПланыСчетов.Основной.НалогНаИмущество;
	ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.ПоЗемельномуНалогу Тогда
		СчетУчетаУслуг = ПланыСчетов.Основной.ЗемельныйНалог;
	ИначеЕсли ДанныеДокумента.Предварительно Тогда
		СчетУчетаУслуг = ПланыСчетов.Основной.ОценочныеЗадолженности;
	ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАренде Тогда
		СчетУчетаУслуг = ПланыСчетов.Основной.РасчетыСПокупателямиИЗаказчиками;
	ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАрендеПеременнаяЧасть Тогда
		СчетУчетаУслуг = ПланыСчетов.Основной.РасчетыСПокупателямиИЗаказчикамиПеременнаяЧасть;
	ИначеЕсли КомиссияПоБиржевымДепозитам Тогда
		СчетУчетаУслуг = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
		Дата, 
		Организация, 
		СчетДоверительногоУправления,
		ВидЗадолженности,
		УчетныйРегистр,
		"СчетУчета");

	Иначе
		Если ДокументСсылка.Валюта = Организация.ВалютаУчета Тогда 
			СчетУчетаУслуг = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
			Дата, 
			Организация, 
			СчетДоверительногоУправления,
			ВидЗадолженности,
			УчетныйРегистр,
			"СчетУчета");
		Иначе 
			СчетУчетаУслуг = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВВалюте;
		КонецЕсли;
	КонецЕсли; 	
	
	ПоНДФЛ = Ложь;
	Если НЕ ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ)  Тогда 
		АналитикаУслугКомиссии = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
		Дата, 
		Организация, 
		СчетДоверительногоУправления,
		ВидЗадолженности,
		УчетныйРегистр,
		"Аналитика");
		ПроверятьАналитику = Истина;
	Иначе 
		ПоНДФЛ = Истина;  //Для НДФЛ аналитику не проверяем
	КонецЕсли;	
		
	АналитикаУслугКомиссииРЕПО = "";		
		
	ВыделятьРасходыПриПродаже = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата, 
		Организация,
		СчетДоверительногоУправления,
		УчетныйРегистр,
		"ВыделятьРасходыПриПродаже");
		
	ВключатьРасходыПоПокупкеВСтоимость = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата, 
		Организация,
		СчетДоверительногоУправления,
		УчетныйРегистр,
		"ВключатьРасходыПоПокупкеВСтоимость");
		
	Если ВключатьРасходыПоПокупкеВСтоимость = Неопределено Тогда
		ВключатьРасходыПоПокупкеВСтоимость = Ложь;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПрочиеДоходыИРасходы) Тогда
		
		ПрочиеДоходыИРасходы = АналитикаУслугКомиссии;
		
		Если НЕ ЗначениеЗаполнено(АналитикаУслугКомиссии) И НЕ ПоНДФЛ  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена аналитика по комиссии для вида задолженности """+ВидЗадолженности+""". Документ " + ДокументСсылка + " не проведен по виду учета " + УчетныйРегистр + "!",ДокументСсылка,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетУчетаУслуг) Тогда	
		ЕстьСубконтоКонтрагенты        = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
		ЕстьСубконтоСделки             = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Сделка) <> Неопределено);
		ЕстьСубконтоДоговоры	       = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры) <> Неопределено);
		ЕстьСубконтоДоговорыДепо       = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыДепозитарногоОбслуживания) <> Неопределено);
		ЕстьСубконтоБрокерскиеДоговоры = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено);
		ЕстьСубконтоОснованиеРасчетов  = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов) <> Неопределено);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках учета не определен счет учета по выбранному виду задолженности. Документ " + ДокументСсылка + " не проведен по виду учета " + УчетныйРегистр + "!", ДокументСсылка,,,Отказ);
		Возврат Движения;
	КонецЕсли; 
	
	ВестиУчетНДС = РаботаСНДС.ВестиУчетНДС(Дата, Организация, СчетДоверительногоУправления);
			
	ТипЗадолженностиДокумента = Справочники.ВидыЗадолженности.ОпределитьТипЗадолженности(ВидЗадолженности);
	
	//Аванс
	СуммаАвансаЗачтенногоБЭКОФИСом = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЗадолженностиПоДенежнымСредствам.Сумма) КАК СуммаАвансаБЭК
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Регистратор = &Регистратор
		|	И ЗадолженностиПоДенежнымСредствам.Аванс
		|	И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
	
	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.СуммаАвансаБЭК <> NULL Цикл
		СуммаАвансаЗачтенногоБЭКОФИСом = ВыборкаДетальныеЗаписи.СуммаАвансаБЭК;
	КонецЦикла;
	//Аванс
		
	Для Каждого Основание Из Основания Цикл
		
		Если ДокументСсылка.Валюта <> Организация.ВалютаУчета Тогда 
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Основание.Сумма, ДокументСсылка.Валюта, Организация, Дата);
		Иначе	
			СуммаОперации = Основание.Сумма;
		КонецЕсли;		
		
		Если ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.СделкаРЕПО") Тогда // особая штука
			
			МетодПризнанияРасходовПоСделкамРЕПО = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
				Основание.Основание.Дата, 
				Организация, 
				СчетДоверительногоУправления,
				УчетныйРегистр,
				"МетодПризнанияРасходовПоСделкамРЕПО");
			
			Если Не ЗначениеЗаполнено(МетодПризнанияРасходовПоСделкамРЕПО) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках по виду учета не определен метод признания расходов по сделке РЕПО. Документ " + ДокументСсылка + " не проведен по виду учета " + УчетныйРегистр + "!", ДокументСсылка,,,Отказ);
				Возврат Движения;
			КонецЕсли;	
				
			Если ЭтоПроведениеНачисления Тогда
				
				Если МетодПризнанияРасходовПоСделкамРЕПО = Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичностиСОтражениемНаСчетеРасчетов Тогда
					
					// сделать проводку сч76.16 счКомиссии
				
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаОперации, "Начисление задолженности");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Основной.РасчетыПоКомиссии;
					Проводка.СубконтоДт.Контрагенты = Контрагент;
					Проводка.СубконтоДт.Сделка = Основание.Основание;
					
					Если ДокументСсылка.Валюта <> Организация.ВалютаУчета Тогда 
						Проводка.ВалютаДт = ДокументСсылка.Валюта;
						Проводка.ВалютнаяСуммаДт = Основание.Сумма;
					КонецЕсли;	
					
					
					// кредит
					Проводка.СчетКт = СчетУчетаУслуг;
					Если ЕстьСубконтоКонтрагенты Тогда
						Проводка.СубконтоКт.Контрагенты = Контрагент;
					КонецЕсли;
					Если ЕстьСубконтоСделки Тогда
						Проводка.СубконтоКт.Сделка = Основание.Основание;
					КонецЕсли;
					Если ЕстьСубконтоДоговорыДепо Тогда
						Проводка.СубконтоКт.ДоговорыДепозитарногоОбслуживания = Договор;
					КонецЕсли;
					
					Если ДокументСсылка.Валюта <> Организация.ВалютаУчета Тогда 
						Проводка.ВалютаКт = ДокументСсылка.Валюта;
						Проводка.ВалютнаяСуммаКт = Основание.Сумма;
					КонецЕсли;	
				
					Продолжить;
					
				ИначеЕсли МетодПризнанияРасходовПоСделкамРЕПО <> Перечисления.МетодыПризнанияРасходовПоСделкам.ПриНачислении Тогда
//				Если МетодПризнанияРасходовПоСделкамРЕПО <> Перечисления.МетодыПризнанияРасходовПоСделкам.ПриНачислении И Основание.Основание.ДатаВторойЧастиРЕПО > Дата Тогда
				
					Продолжить;
					
				КонецЕсли;
				
			Иначе // это оплата
				
				// Пусть оплата сама сформирует
				
				//Если МетодПризнанияРасходовПоСделкамРЕПО <> Перечисления.МетодыПризнанияРасходовПоСделкам.ПриОплате Тогда
				//
					Продолжить;
				//
				//КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
		ПараметрыПроверкиНачисления = новый Структура("Дата, МетодОпределенияДоходовИРасходов, ЭтоПроведениеНачисления, Основание, "
			+ "ВидЗадолженности, ВидДоговораДоверительногоУправления, ВключатьРасходыПоПокупкеВСтоимость",
			ДокументСсылка.Дата,
			МетодОпределенияДоходовИРасходов,
			ЭтоПроведениеНачисления, 
			Основание.Основание,
			ВидЗадолженности,
			СчетДоверительногоУправления.ВидДоговораДоверительногоУправления,
			ВключатьРасходыПоПокупкеВСтоимость);
			
		Если Не НеобходимоСформироватьПроводкиНачисленияЗадолженности(ПараметрыПроверкиНачисления) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПрочимДоходам Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаОперации, "Начисление задолженности");
			
			// дебет
			Проводка.СчетДт = СчетУчетаУслуг;
			Если ЕстьСубконтоКонтрагенты Тогда
				Проводка.СубконтоДт.Контрагенты = Контрагент;
			КонецЕсли;
			Если ЕстьСубконтоСделки Тогда
				Проводка.СубконтоДт.Сделка = Основание.Основание;
			КонецЕсли;
			Если ЕстьСубконтоДоговорыДепо Тогда
				Проводка.СубконтоДт.ДоговорыДепозитарногоОбслуживания = Договор;
			КонецЕсли;
			
			Если ДокументСсылка.Валюта <> Организация.ВалютаУчета Тогда 
				Проводка.ВалютаДт = ДокументСсылка.Валюта;
				Проводка.ВалютнаяСуммаДт = Основание.Сумма;
			КонецЕсли;	
			
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
			Проводка.СубконтоКт.ПрочиеДоходыИРасходы = ПрочиеДоходыИРасходы;
			
			Продолжить;
			
		ИначеЕсли ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ) Тогда	
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаОперации, "Начисление НДФЛ");

			Если ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.Сделка") Тогда
				Проводка.СчетДт = ПланыСчетов.Основной.РасчетыСКонтрагентами;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
			Иначе
				Проводка.СчетДт = ПланыСчетов.Основной.ПрибылиИУбытки;
			КонецЕсли;
			Проводка.СчетКт = СчетУчетаУслуг;
			Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
			
			Продолжить;
			
		ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаИмущество
			 ИЛИ ВидЗадолженности = Справочники.ВидыЗадолженности.ПоЗемельномуНалогу
			 ИЛИ ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаПрибыль Тогда	
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаОперации, "Начисление налога");

			Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ПрочиеДоходыИРасходы; 
			Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаПрибыль Тогда
				Проводка.СубконтоДт.ЦенныеБумаги = Основание.ЦеннаяБумага;    
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = СведенияОбОбращенииКорзиныЦенныхБумагНаОРЦБ.Найти(Основание.ЦеннаяБумага, "ЦеннаяБумага").ОбращаетсяНаОРЦБ;
			КонецЕсли;
			Проводка.СчетКт = СчетУчетаУслуг;
			Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
			
			Продолжить;
		
		ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.РасчетыСПайщикамиПоВыплатеДоходаПоИнвестиционнымПаям Тогда	
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаОперации, "Начисление инвестиционного дохода");
			
			Проводка.СчетДт = ПланыСчетов.Основной.РаспределениеДоходаМеждуПайщиками;
			Проводка.СубконтоДт.Контрагенты = Контрагент;
			
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			
			Продолжить;	

		ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАренде
			Или ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАрендеПеременнаяЧасть 
			Или ВидЗадолженности = Справочники.ВидыЗадолженности.ПоУслугамПрочегоИспользованияИмущества Тогда	
			
			Если ТипЗадолженностиДокумента = Перечисления.ТипыЗадолженности.Дебиторская Тогда
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаОперации, "Начисление дохода по аренде");
				
				Проводка.СчетДт = СчетУчетаУслуг;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				
				Если ЕстьСубконтоДоговоры Тогда
					Проводка.СубконтоДт.Договоры = Договор;
				КонецЕсли;
				
				Если ЕстьСубконтоОснованиеРасчетов Тогда
					Проводка.СубконтоДт.ОснованиеРасчетов = ДокументСсылка;
				КонецЕсли;
				
				Если ДанныеДокумента.Предварительно Тогда
					Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
				Иначе
					Проводка.СчетКт = ПланыСчетов.Основной.Выручка;
				КонецЕсли;
				
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = ПрочиеДоходыИРасходы;
				Проводка.СубконтоКт.ЦенныеБумаги = Договор;
				
				Если СуммаАвансаЗачтенногоБЭКОФИСом > 0 Тогда
					
					ЗачитываемаяСуммаАванса = Мин(СуммаАвансаЗачтенногоБЭКОФИСом, СуммаОперации);
					СуммаАвансаЗачтенногоБЭКОФИСом = СуммаАвансаЗачтенногоБЭКОФИСом - ЗачитываемаяСуммаАванса;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ЗачитываемаяСуммаАванса, "Зачет аванса");
					
					Проводка.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателямиИЗаказчикамиАвансыПолученные;
					
					Проводка.СубконтоДт.Контрагенты = Контрагент;
					Проводка.СубконтоДт.Договоры 	= Договор;
					
					Проводка.СчетКт 				= СчетУчетаУслуг;
					
					Проводка.СубконтоКт.Договоры 	= Договор;
					Проводка.СубконтоКт.Контрагенты = Контрагент;	
					
				КонецЕсли;
				
				Если ВестиУчетНДС и Основание.СуммаНДС<>0 Тогда
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Основание.СуммаНДС, "Начислен НДС");
					
					Проводка.СчетДт = ПланыСчетов.Основной.ПродажиНДС;
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ПрочиеДоходыИРасходы;
					Проводка.СубконтоДт.СтавкиНДС	= Основание.СтавкаНДС;
					
					Проводка.СчетКт 				= ПланыСчетов.Основной.НДС;
					Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
						
				КонецЕсли;
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение начисления по договору получения имущества в аренду не реализовано. Документ " + ДокументСсылка + " не проведен по виду учета " + УчетныйРегистр + "!", ДокументСсылка,,,Отказ);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		АналитикаУслуг = АналитикаУслугКомиссии;
		
		ИспользоватьСчет76_16 = Ложь;
		Если ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.Сделка")
			И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР
			И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
			
			Если ВключатьРасходыПоПокупкеВСтоимость ИЛИ Основание.Основание.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
				
				Если Основание.Основание.ОтложенноеИсполнение Тогда
					ИспользоватьСчет76_16 = Истина;	
				КонецЕсли;
				
				Если Не ВыделятьРасходыПриПродаже Тогда
					
					Рынок        = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(Основание.ЦеннаяБумага);
					УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Рынок, Основание.ЦеннаяБумага);
					
					НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
									Дата,
									Организация,
									СчетДоверительногоУправления,
									УчетныйАктив,
									УчетныйРегистр);		
									
					Если Не (ТипЗнч(Основание.ЦеннаяБумага) = Тип("СправочникСсылка.ПроизводныеФинансовыеИнструменты")
						И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание.ЦеннаяБумага, "ТипПроизводногоФинансовогоИнструмента") = Перечисления.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)  Тогда				
						АналитикаУслуг = НастройкиУчета.АналитикаДоходовОтРеализации; 
					КонецЕсли;	

				КонецЕсли;
				
			Иначе
				Если ТипЗнч(Основание.ЦеннаяБумага) = Тип("СправочникСсылка.ПроизводныеФинансовыеИнструменты")
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание.ЦеннаяБумага, "ТипПроизводногоФинансовогоИнструмента") = Перечисления.ТипыПроизводныхФинансовыхИнструментов.Фьючерс Тогда
					ИспользоватьСчет76_16 = Ложь;	
				Иначе
					ИспользоватьСчет76_16 = ВключатьРасходыПоПокупкеВСтоимость;	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		
		ДанныеАналитики = Новый Структура("Сделка, ВидЗадолженности", Основание.Основание, ВидЗадолженности);
		
		СуммаВыделенногоНДС = 0;
		
		Если ВестиУчетНДС И Основание.СуммаНДС > 0  Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Основание.СуммаНДС, "Выделен НДС", ДанныеАналитики);
			
			СчетУчетаНДС = ?(ДанныеДокумента.НДСПоОбщимРасходам, ПланыСчетов.Основной.НДСПоОбщимРасходам, ПланыСчетов.Основной.НДСПоПрямымРасходам);
			
			Проводка.СчетДт = СчетУчетаНДС;
			Проводка.СубконтоДт.Контрагенты = Контрагент;
			Проводка.СубконтоДт.СчетаФактуры = ДокументСсылка;
			
			Проводка.СчетКт = СчетУчетаУслуг;
			
			Если ДокументСсылка.Валюта <> Организация.ВалютаУчета Тогда 
				Проводка.ВалютаКт = ДокументСсылка.Валюта;
				Проводка.ВалютнаяСуммаКт = Основание.Сумма;
			КонецЕсли;	
			
			Если ЕстьСубконтоКонтрагенты Тогда
				Проводка.СубконтоКт.Контрагенты = Контрагент;
			КонецЕсли;
			
			Если ЕстьСубконтоДоговоры Тогда
				Проводка.СубконтоКт.Договоры = Договор;
			КонецЕсли;

			Если ЕстьСубконтоСделки Тогда
				Проводка.СубконтоКт.Сделка = Основание.Основание;
			КонецЕсли;
			
			Если ДанныеДокумента.НДСВключатьВСтоимость Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Основание.СуммаНДС, "НДС отнесен не расходы", ДанныеАналитики);
			
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаУслуг;
				Проводка.СубконтоДт.ЦенныеБумаги         = Неопределено;
				
				Проводка.СчетКт = СчетУчетаНДС;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				Проводка.СубконтоКт.СчетаФактуры = ДокументСсылка;
				
			ИначеЕсли ДанныеДокумента.ЗачестьНДС Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Основание.СуммаНДС, "Зачтен НДС", ДанныеАналитики);
			
				Проводка.СчетДт = ПланыСчетов.Основной.НДС;
				Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
				
				Проводка.СчетКт = СчетУчетаНДС;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				Проводка.СубконтоКт.СчетаФактуры = ДокументСсылка;
				
			КонецЕсли;
			
			СуммаОперации = СуммаОперации - Основание.СуммаНДС;
			СуммаВыделенногоНДС = Основание.СуммаНДС;
			
		КонецЕсли;
		
		ФормироватьПроводкуПоступленияУслуг = Истина;
		
		МетодПризнанияРасходовПоБиржевымДепозитам = Неопределено;
		Если КомиссияПоБиржевымДепозитам Тогда
			МетодПризнанияРасходовПоБиржевымДепозитам = 
				БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
					Дата, 
					Организация,
					СчетДоверительногоУправления,
					УчетныйРегистр,
					"МетодПризнанияРасходовПоБиржевымДепозитам");
			
			Если МетодПризнанияРасходовПоБиржевымДепозитам = Перечисления.МетодыПризнанияРасходовПоСделкам.ПриЗакрытии 
				ИЛИ МетодПризнанияРасходовПоБиржевымДепозитам = Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичности
				ИЛИ МетодПризнанияРасходовПоБиржевымДепозитам = Перечисления.МетодыПризнанияРасходовПоСделкам.ПриНачислении Тогда
				ФормироватьПроводкуПоступленияУслуг = Ложь;
			КонецЕсли;	
		КонецЕсли;
		
		Если ФормироватьПроводкуПоступленияУслуг Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаОперации, "Поступление услуг", ДанныеАналитики);
			
			// дебет
			Если ИспользоватьСчет76_16 Тогда
				
				Проводка.СчетДт = ПланыСчетов.Основной.РасчетыПоКомиссии;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.Сделка      = Основание.Основание;
				
			Иначе
				
				Если ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
					Если АналитикаУслугКомиссииРЕПО = "" Тогда
						АналитикаУслугКомиссииРЕПО = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
						Дата, 
						Организация, 
						СчетДоверительногоУправления,
						ВидЗадолженности,
						УчетныйРегистр,
						"АналитикаРЕПО"); 
						
						Если НЕ ЗначениеЗаполнено(АналитикаУслугКомиссииРЕПО) Тогда 
							АналитикаУслугКомиссииРЕПО = АналитикаУслугКомиссии;
						КонецЕсли;
					КонецЕсли;		
					АналитикаУслуг = АналитикаУслугКомиссииРЕПО;
				ИначеЕсли ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.Сделка") Тогда
					//аналитика определена выше. Либо настройка комиссии, либо продажа/ бумаг
				Иначе
					Если ЗначениеЗаполнено(ПрочиеДоходыИРасходы) Тогда
						АналитикаУслуг = ПрочиеДоходыИРасходы;
					КонецЕсли;				
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(ПрочиеДоходыИРасходы) 
					И ЗначениеЗаполнено(ПрочиеДоходыИРасходы.Резерв)
					И Справочники.СчетаДоверительногоУправления.НачислятьРезервыПредстоящихРасходов(СчетДоверительногоУправления, Дата, ПрочиеДоходыИРасходы.Резерв) Тогда
					
					Проводка.СчетДт = ПланыСчетов.Основной.РезервыПредстоящихРасходов;
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаУслуг;
					Проводка.СубконтоДт.Резервы              = ПрочиеДоходыИРасходы.Резерв;
					
				ИначеЕсли ЗначениеЗаполнено(Арендатор) Тогда	
					
					Проводка.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателямиИЗаказчиками;
					Проводка.СубконтоДт.Контрагенты = Арендатор;
					Проводка.СубконтоДт.Договоры = ДоговорАренды;
					
				Иначе
					
					Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаУслуг;
					Проводка.СубконтоДт.ЦенныеБумаги         = ?(УказыватьДоговорВАналитике, Договор, Основание.ЦеннаяБумага);	
					Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ?(УказыватьДоговорВАналитике, Неопределено, СведенияОбОбращенииКорзиныЦенныхБумагНаОРЦБ.Найти(Основание.ЦеннаяБумага, "ЦеннаяБумага").ОбращаетсяНаОРЦБ);
					
				КонецЕсли;
				
			КонецЕсли;
			
			// кредит
			Проводка.СчетКт = СчетУчетаУслуг;
			
			Если ДокументСсылка.Валюта <> Организация.ВалютаУчета Тогда 
				Проводка.ВалютаКт = ДокументСсылка.Валюта;
				Проводка.ВалютнаяСуммаКт = Основание.Сумма;
			КонецЕсли;	
			
			Если ЕстьСубконтоКонтрагенты Тогда
				Проводка.СубконтоКт.Контрагенты = Контрагент;
			КонецЕсли;
			
			Если ЕстьСубконтоСделки Тогда
				Проводка.СубконтоКт.Сделка = Основание.Основание;
			КонецЕсли;
			
			Если ЕстьСубконтоДоговорыДепо Тогда
				Проводка.СубконтоКт.ДоговорыДепозитарногоОбслуживания = Договор;
			КонецЕсли;
			
			Если ЕстьСубконтоДоговоры Тогда
				Проводка.СубконтоКт.Договоры = Договор;
			КонецЕсли;
			
			Если ЕстьСубконтоБрокерскиеДоговоры Тогда
				Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(СчетДоверительногоУправления, Брокер, Дата);
				Если НЕ ЗначениеЗаполнено(Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания) Тогда
					Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(СчетДоверительногоУправления, Справочники.БрокерскиеКомпании.ПолучитьБрокерскуюКомпаниюПоЮрФизЛицу(Контрагент), Дата);
				КонецЕсли;
			КонецЕсли;
			
			Если ЕстьСубконтоОснованиеРасчетов Тогда
				Проводка.СубконтоКт.ОснованиеРасчетов = ДокументСсылка;
			КонецЕсли;
		КонецЕсли;	
		
		Если КомиссияПоБиржевымДепозитам Тогда
			Если МетодПризнанияРасходовПоБиржевымДепозитам = Неопределено Тогда
				МетодПризнанияРасходовПоБиржевымДепозитам = 
					БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
						Дата, 
						Организация,
						СчетДоверительногоУправления,
						УчетныйРегистр,
						"МетодПризнанияРасходовПоБиржевымДепозитам");
			КонецЕсли;			
			
			Если МетодПризнанияРасходовПоБиржевымДепозитам = Перечисления.МетодыПризнанияРасходовПоСделкам.ПриОткрытии Тогда 	
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаОперации, "Списание расходов", ДанныеАналитики);
				
				// дебет
				Проводка.СчетДт = СчетУчетаУслуг;
				
				Если ДокументСсылка.Валюта <> Организация.ВалютаУчета Тогда 
					Проводка.ВалютаДт = ДокументСсылка.Валюта;
					Проводка.ВалютнаяСуммаДт = Основание.Сумма;
				КонецЕсли;	
				
				Если ЕстьСубконтоКонтрагенты Тогда
					Проводка.СубконтоДт.Контрагенты = Контрагент;
				КонецЕсли;
				
				Если ЕстьСубконтоСделки Тогда
					Проводка.СубконтоДт.Сделка = Основание.Основание;
				КонецЕсли;
				
				Если ЕстьСубконтоДоговорыДепо Тогда
					Проводка.СубконтоДт.ДоговорыДепозитарногоОбслуживания = Договор;
				КонецЕсли;
				
				Если ЕстьСубконтоБрокерскиеДоговоры Тогда
					Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(СчетДоверительногоУправления, Брокер, Дата);
					Если НЕ ЗначениеЗаполнено(Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания) Тогда
						Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(СчетДоверительногоУправления, Справочники.БрокерскиеКомпании.ПолучитьБрокерскуюКомпаниюПоЮрФизЛицу(Контрагент), Дата);
					КонецЕсли;
				КонецЕсли;
				
				Если ЕстьСубконтоОснованиеРасчетов Тогда
					Проводка.СубконтоДт.ОснованиеРасчетов = ДокументСсылка;
				КонецЕсли;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Основной.РасчетыПоКомиссии;
				
				Если ДокументСсылка.Валюта <> Организация.ВалютаУчета Тогда 
					Проводка.ВалютаКт = ДокументСсылка.Валюта;
					Проводка.ВалютнаяСуммаКт = Основание.Сумма;
				КонецЕсли;	
				
				Если ЕстьСубконтоКонтрагенты Тогда
					Проводка.СубконтоКт.Контрагенты = Контрагент;
				КонецЕсли;
				
				Если ЕстьСубконтоСделки Тогда
					Проводка.СубконтоКт.Сделка = Основание.Основание;
				КонецЕсли;
				
				Если ЕстьСубконтоДоговорыДепо Тогда
					Проводка.СубконтоКт.ДоговорыДепозитарногоОбслуживания = Договор;
				КонецЕсли;
				
				Если ЕстьСубконтоБрокерскиеДоговоры Тогда
					Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(СчетДоверительногоУправления, Брокер, Дата);
					Если НЕ ЗначениеЗаполнено(Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания) Тогда
						Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(СчетДоверительногоУправления, Справочники.БрокерскиеКомпании.ПолучитьБрокерскуюКомпаниюПоЮрФизЛицу(Контрагент), Дата);
					КонецЕсли;
				КонецЕсли;
				
				Если ЕстьСубконтоОснованиеРасчетов Тогда
					Проводка.СубконтоКт.ОснованиеРасчетов = ДокументСсылка;
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли;	
	
		
		//очень надеюсь, что авансов в валюте еще долго не будет. И что делать, если аванс и оплата в разных валютах?			
		Если СуммаАвансаЗачтенногоБЭКОФИСом > 0 Тогда
			
			ЗачитываемаяСуммаАванса = Мин(СуммаАвансаЗачтенногоБЭКОФИСом, СуммаОперации + СуммаВыделенногоНДС);
			СуммаАвансаЗачтенногоБЭКОФИСом = СуммаАвансаЗачтенногоБЭКОФИСом - ЗачитываемаяСуммаАванса;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ЗачитываемаяСуммаАванса, "Зачет аванса");
			
			Проводка.СчетДт = СчетУчетаУслуг;
			
			Если ЕстьСубконтоКонтрагенты Тогда
				Проводка.СубконтоДт.Контрагенты = Контрагент;
			КонецЕсли;
			
			Если ЕстьСубконтоДоговоры Тогда
				Проводка.СубконтоДт.Договоры = Договор;
			КонецЕсли;
			
			Если ЕстьСубконтоСделки Тогда
				Проводка.СубконтоДт.Сделка = Основание.Основание;
			КонецЕсли;
			
			Если ЕстьСубконтоДоговорыДепо Тогда
				Проводка.СубконтоДт.ДоговорыДепозитарногоОбслуживания = Договор;
			КонецЕсли;
			
			Если ЕстьСубконтоБрокерскиеДоговоры Тогда
				Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(СчетДоверительногоУправления, Брокер, Дата);
				Если НЕ ЗначениеЗаполнено(Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания) Тогда
					Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(СчетДоверительногоУправления, Справочники.БрокерскиеКомпании.ПолучитьБрокерскуюКомпаниюПоЮрФизЛицу(Контрагент), Дата);
				КонецЕсли;
			КонецЕсли;
			
			Проводка.СчетКт 				= ПланыСчетов.Основной.РасчетыПоАвансамВыданным;
			Проводка.СубконтоКт.Договоры 	= ?(ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего, СчетДоверительногоУправления, Договор);
			Проводка.СубконтоКт.Контрагенты = Контрагент;	
			
		КонецЕсли;
		
	КонецЦикла;	
	
	//НДС по авансам
	РаботаСНДС.СформироватьПроводкиЗачетаНДСПоАвансам(ДокументСсылка, Движения, Контрагент);
	
	//Сторно предварительных начислений
	АналитикаПредварительно = Справочники.ВидыЗадолженности.ПолучитьАналитикуДляПредварительныхНачисленийПоВидуЗадолженности(ВидЗадолженности);	
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма,
		|	ЗадолженностиПоДенежнымСредствам.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствам.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствам.ВидЗадолженности КАК ВидЗадолженности,
		|	НачислениеЗадолженности.Дата КАК ДатаНачисленияПредварительных
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|		ПО ЗадолженностиПоДенежнымСредствам.Основание = НачислениеЗадолженности.Ссылка
		|			И (НачислениеЗадолженности.Предварительно)
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Регистратор = &Регистратор
		|	И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ЗадолженностиПоДенежнымСредствам.Сумма < 0";
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	ТекущийГод = Год(Дата);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.Сумма, "Сторно предварительных начислений");
		
		Если ТипЗадолженностиДокумента = Перечисления.ТипыЗадолженности.Дебиторская Тогда
			
			Если ВыборкаДетальныеЗаписи.ВидЗадолженности = ВидЗадолженности Тогда
				
				Проводка.СчетДт = ПланыСчетов.Основной.ОценочныеЗадолженности;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.Основание;
				
				Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаПредварительно;
				Проводка.СубконтоКт.ЦенныеБумаги = ?(УказыватьДоговорВАналитике, Договор, Неопределено);
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.НДСТекущегоПериода Тогда
				
				Проводка.СчетДт = ПланыСчетов.Основной.ПродажиНДС;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаПредварительно;
				Проводка.СубконтоДт.СтавкиНДС = РаботаСНДС.ПолучитьСтавкуНДСДляДокумента(ВыборкаДетальныеЗаписи.Основание, Отказ);
				
				Проводка.СчетКт = ПланыСчетов.Основной.НДС;
				Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
				
			КонецЕсли;

		Иначе
			
			Если ЗначениеЗаполнено(АналитикаПредварительно) 
				И ЗначениеЗаполнено(АналитикаПредварительно.Резерв)
				И Справочники.СчетаДоверительногоУправления.НачислятьРезервыПредстоящихРасходов(СчетДоверительногоУправления, Дата, АналитикаПредварительно.Резерв) Тогда
				
				Проводка.СчетДт = ПланыСчетов.Основной.РезервыПредстоящихРасходов;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаПредварительно;
				Проводка.СубконтоДт.Резервы              = АналитикаПредварительно.Резерв;
			Иначе
				
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаПредварительно;
				Проводка.СубконтоДт.ЦенныеБумаги = ?(УказыватьДоговорВАналитике, Договор, Неопределено);
			КонецЕсли;
			
			Проводка.СчетКт = ПланыСчетов.Основной.ОценочныеЗадолженности;
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.Основание;
			
		КонецЕсли;
	
		//Заменим сторно на обратную проводку
		Если  ТекущийГод > 2023 И Год(ВыборкаДетальныеЗаписи.ДатаНачисленияПредварительных) <> ТекущийГод Тогда
			 
			Проводка.Сумма = - Проводка.Сумма;
			
			ВремСчетДт = Проводка.СчетДт;
			ВремСубконтоДт = Новый Структура;
			Для Каждого ЗначСубконто из Проводка.СубконтоДт Цикл
				ВремСубконтоДт.Вставить(ЗначСубконто.Ключ.ИмяПредопределенныхДанных, ЗначСубконто.Значение);
				Проводка.СубконтоДт.Удалить(ЗначСубконто.Ключ);
			КонецЦикла;
			
			Проводка.СчетДт = ИнвертироватьСчетДоходовРасходов(Проводка.СчетКт);
			Для Каждого ЗначСубконто из Проводка.СубконтоКт Цикл
				Проводка.СубконтоДт[ЗначСубконто.Ключ] = ЗначСубконто.Значение;
				Проводка.СубконтоКт.Удалить(ЗначСубконто.Ключ);
			КонецЦикла;
			
			Проводка.СчетКт = ИнвертироватьСчетДоходовРасходов(ВремСчетДт);
			Для Каждого Значение Из ВремСубконтоДт Цикл
				Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто[Значение.Ключ]] = Значение.Значение;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Движения;
	
КонецФункции // ПодготовитьНаборПроводок()

Функция ИнвертироватьСчетДоходовРасходов(СчетУчета)
	
	Если СчетУчета = ПланыСчетов.Основной.ПрочиеРасходы Тогда
		Возврат ПланыСчетов.Основной.ПрочиеДоходы;
	ИначеЕсли СчетУчета = ПланыСчетов.Основной.ПрочиеДоходы Тогда
		Возврат ПланыСчетов.Основной.ПрочиеРасходы;
	Иначе 
		Возврат СчетУчета;
	КонецЕсли;	
	
КонецФункции

Функция НеобходимоСформироватьПроводкиНачисленияЗадолженности(ПараметрыПроверки) Экспорт
	
	Если ПараметрыПроверки.МетодОпределенияДоходовИРасходов = Перечисления.МетодыОпределенияДоходовИРасходов.Кассовый Тогда
		
		// Торговую и брокерскую по сделкам при кассовом не проводим
		Если (ТипЗнч(ПараметрыПроверки.Основание) = Тип("ДокументСсылка.Сделка") ИЛИ ТипЗнч(ПараметрыПроверки.Основание) = Тип("ДокументСсылка.СделкаСВалютой"))
			И (ПараметрыПроверки.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии)
				ИЛИ(ПараметрыПроверки.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоТорговойКомиссии) Тогда
				
					Возврат Ложь;
			 
		КонецЕсли;
		
		ПлатаЗаРазмещение = (ПараметрыПроверки.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющегоПлатаЗаРазмещение);
		НетОснованияИНеПоНДФЛ = НЕ ЗначениеЗаполнено(ПараметрыПроверки.Основание) И НЕ ПараметрыПроверки.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ);
										
		Если ПараметрыПроверки.ЭтоПроведениеНачисления Тогда
			Если НетОснованияИНеПоНДФЛ ИЛИ ПлатаЗаРазмещение Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Если НЕ (НетОснованияИНеПоНДФЛ ИЛИ ПлатаЗаРазмещение) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ПараметрыПроверки.МетодОпределенияДоходовИРасходов = Перечисления.МетодыОпределенияДоходовИРасходов.Начисления Тогда
		
		// Торговую и брокерскую комиссию при условиях: + 
		// 0. По СДЕЛКЕ + 
		// 1. Налоговый учет +
		// 2. Метод начислений + 
		// 3. Сделка Т0 + 
		// 4. Покупка + 
		// 5. Комиссия включается в стоимость + 
		// 6. Начисление проходит в день после сделки или позднее
		// 7. Это не ПФР и не ПИФ + 
		// при этих условия мы не начисляем комиссию,
		// проводку по комиссии Дт58 - Кт60 делает сделка
		//
		// условие по налоговому учету отменяется - в БУ тоже самое
		
		Если ТипЗнч(ПараметрыПроверки.Основание) = Тип("ДокументСсылка.Сделка")
			//И СокрЛП(УчетныйРегистр) = "НалоговыйУчет"
			И ((ПараметрыПроверки.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии)ИЛИ(ПараметрыПроверки.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоТорговойКомиссии))
			И ПараметрыПроверки.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР
			И ПараметрыПроверки.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда
			И ПараметрыПроверки.ВключатьРасходыПоПокупкеВСтоимость Тогда
			
			Если НЕ ПараметрыПроверки.Основание.ОтложенноеИсполнение
				И ПараметрыПроверки.Основание.ВидСделки = Перечисления.ВидыСделок.Покупка
				И НачалоДня(ПараметрыПроверки.Основание.Дата) = НачалоДня(ПараметрыПроверки.Дата) Тогда
					Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

Процедура ПодготовитьНаборПроводокПоИнымДоходамПоИмуществу(ДокументСсылка, Движения, УчетныйРегистр, Отказ)
	
	Основания = ПолучитьТаблицуОснований(ДокументСсылка);
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Дата, Организация, СчетДоверительногоУправления, Контрагент, Договор, ВидЗадолженности");
	Дата 						 = ДанныеДокумента.Дата;
	Организация 				 = ДанныеДокумента.Организация;
	СчетДоверительногоУправления = ДанныеДокумента.СчетДоверительногоУправления;
	Контрагент 					 = ДанныеДокумента.Контрагент;
	Договор 					 = ДанныеДокумента.Договор;
	ВидЗадолженности			 = ДанныеДокумента.ВидЗадолженности;
	
	Для Каждого СтрокаОснования из Основания Цикл
		
		ПараметрыУчетаАктива = Новый Структура;
		
		Если ЗначениеЗаполнено(СтрокаОснования.Основание) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен порядок формирования проводок иных доходв по основанию " + СтрокаОснования.Основание, ДокументСсылка,,,Отказ);
			Возврат;
		ИначеЕсли (Договор.ВидДоговора = Перечисления.ВидыДоговоров.СтроительствоНаСвоемУчастке
			Или Договор.ВидДоговора = Перечисления.ВидыДоговоров.СтроительствоНаЧужомУчастке) Тогда
			
			УчетныйАктив = Справочники.УчетныеАктивы.Инвестконтракты;
			ОсновнойВидЗадолженности = Справочники.ВидыЗадолженности.ПоИнвестконтракту;

			ПараметрыУчетаАктива.Вставить("УчетныйАктив", УчетныйАктив);
			ПараметрыУчетаАктива.Вставить("Актив", Договор);
			
			ПараметрыУчетаАктива.Вставить("АналитикаПереоценки", 
				БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
					Дата, 
					Организация, 
					СчетДоверительногоУправления, 
					ОсновнойВидЗадолженности, 
					УчетныйРегистр, 
					"АналитикаПереоценки",
					Истина));
			
			ПараметрыУчетаАктива.Вставить("АналитикаДоходов", 
				БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
					Дата, 
					Организация, 
					СчетДоверительногоУправления, 
					ВидЗадолженности, 
					УчетныйРегистр, 
					"Аналитика",
					Истина));
			
			ПараметрыУчетаАктива.Вставить("СчетПереоценкиРасчетов",
				БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
					Дата, 
					Организация, 
					СчетДоверительногоУправления, 
					ОсновнойВидЗадолженности, 
					УчетныйРегистр, 
					"СчетУчетаПереоценки",
					Истина));
			
			ПараметрыУчетаАктива.Вставить("СчетУчетаРасчетовПоДоходам",
				БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
					Дата, 
					Организация, 
					СчетДоверительногоУправления, 
					ВидЗадолженности, 
					УчетныйРегистр, 
					"СчетУчета",
					Истина));
			
			ПараметрыУчетаАктива.Вставить("Контрагент", Контрагент);
			ПараметрыУчетаАктива.Вставить("ОтложеннаяОплата", Истина);
			ПараметрыУчетаАктива.Вставить("РасчетныйСчет", Неопределено);
				
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определено основание для отражения иных доходов по имуществу", ДокументСсылка,,,Отказ);
			Возврат;
		КонецЕсли;
		
		Документы.ПриходПроцентовПоКредитномуИнструменту.ОтразитьНачислениеПроцентовПоРегиструБухгалтерии(ДокументСсылка, Движения, УчетныйРегистр, ПараметрыУчетаАктива, СтрокаОснования.Сумма, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуОснований(ДокументСсылка)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачислениеЗадолженностиОснования.Ссылка КАК Ссылка,
	|	НачислениеЗадолженностиОснования.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗадолженностиОснования.Основание КАК Основание,
	|	НачислениеЗадолженностиОснования.ДатаОплаты КАК ДатаОплаты,
	|	НачислениеЗадолженностиОснования.ЦеннаяБумага КАК ЦеннаяБумага,
	|	НачислениеЗадолженностиОснования.Сумма КАК Сумма,
	|	НачислениеЗадолженностиОснования.СтавкаНДС КАК СтавкаНДС,
	|	НачислениеЗадолженностиОснования.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
	|ГДЕ
	|	НачислениеЗадолженностиОснования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции // ПолучитьТаблицуОснований()

Функция ПроверитьЗаполнениеПериодаНачисленияЗадолженности(ВидЗадолженности, ДатаНачалаПериодичностиНачисления, НайденныеНачисления = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеЗадолженности.Ссылка КАК Документ,
		|	НачислениеЗадолженности.Организация КАК Организация
		|ИЗ
		|	Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|ГДЕ
		|	НачислениеЗадолженности.Проведен
		|	И НачислениеЗадолженности.ВидЗадолженности = &ВидЗадолженности
		|	И НачислениеЗадолженности.Дата >= &ДатаНачалаПериодичностиНачисления
		|	И (НачислениеЗадолженности.НачалоПериодаНачисления = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ НачислениеЗадолженности.ОкончаниеПериодаНачисления = ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НачислениеЗадолженности.Дата");
	
	Запрос.УстановитьПараметр("ВидЗадолженности",					ВидЗадолженности);
	Запрос.УстановитьПараметр("ДатаНачалаПериодичностиНачисления",	ДатаНачалаПериодичностиНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НайденныеНачисления = Неопределено;
		ПроверкаПройдена	= Истина;
	Иначе	
		НайденныеНачисления = РезультатЗапроса.Выгрузить();
		ПроверкаПройдена	= Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПроверкаПройдена;
	
КонецФункции

Функция СодержаниеИспользуетсяДляХраненияДанных(ВидЗадолженности) Экспорт
	
	Возврат ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаИмущество
		Или ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАрендеПеременнаяЧасть;
		
КонецФункции

Функция ПолучитьДополнительныеДанныеИзСодержания(СтрокаСодержания) Экспорт
	
	Если ТипЗнч(СтрокаСодержания) <> Тип("Строка") 
		ИЛИ Не СтрНачинаетсяС(СокрЛ(СтрокаСодержания), "<") Тогда
		Возврат Неопределено; //это не XML
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаСодержания);
	
КонецФункции

Функция ПолучитьСписокЕдиницИзмерения() Экспорт
	
	ЕдиницыИзмерения = Новый СписокЗначений;
	ЕдиницыИзмерения.Добавить("362", "мес");
	ЕдиницыИзмерения.Добавить("113", "м3");
	ЕдиницыИзмерения.Добавить("233", "Гкал");
	ЕдиницыИзмерения.Добавить("245", "кВт-ч");
	ЕдиницыИзмерения.Добавить("769", "шт");
	
	Возврат ЕдиницыИзмерения;
	
КонецФункции
